from random import choice

# Словари с заменами для латинских и русских символов с учетом регистра
UNICODE_MAP = {
    'a': ['ᴬ', '𝔸', '𝖠', '𝘈', '𝐴', '𝘼', '𝑨', '𝐀', '𝗔', '𝙰', 'Ａ'],
    'b': ['ᴮ', '𝔹', '𝖡', '𝘉', '𝐵', '𝘽', '𝑩', '𝐁', '𝗕', '𝙱', 'Ｂ'],
    'c': ['ᶜ', 'ℂ', '𝖢', '𝘊', '𝒞', '𝘾', '𝑪', '𝐂', '𝗖', 'Ｃ'],
    'd': ['ᴰ', '𝔻', '𝖣', '𝘋', '𝐷', '𝘿', '𝑫', '𝐃', '𝗗', '𝘿', 'Ｄ'],
    'e': ['ᴱ', '𝔼', '𝖤', '𝘌', '𝐸', '𝙴', '𝑬', '𝐄', '𝗘', '𝙴', 'Ｅ'],
    'f': ['ᶠ', '𝖥', '𝘍', '𝐹', '𝑭', '𝐅', '𝗙', '𝙵', 'Ｆ'],
    'g': ['ᴳ', '𝔾', '𝖦', '𝘎', '𝐺', '𝙂', '𝑮', '𝐺', '𝗚', '𝙶', 'Ｇ'],
    'h': ['ᴴ', 'ℍ', '𝖧', '𝘏', '𝐻', '𝙷', '𝑯', '𝐇', '𝗛', '𝙷', 'Ｈ'],
    'i': ['ᴵ', '𝕀', '𝖨', '𝘐', '𝐼', '𝙸', '𝑰', '𝐼', '𝗜', '𝙸', 'Ｉ'],
    'j': ['ᴶ', '𝕁', '𝖩', '𝘑', '𝒥', '𝙹', '𝑱', '𝐽', '𝗝', '𝙹', 'Ｊ'],
    'k': ['ᴷ', '𝕂', '𝖪', '𝘒', '𝒦', '𝙺', '𝑲', '𝐾', '𝗞', '𝙺', 'Ｋ'],
    'l': ['ᴸ', '𝕃', '𝖫', '𝘓', '𝐿', '𝙻', '𝑳', '𝐿', '𝗟', '𝙻', 'Ｌ'],
    'm': ['ᴹ', '𝕄', '𝖬', '𝘔', '𝑀', '𝙼', '𝑴', '𝗠', '𝙼', 'Ｍ'],
    'n': ['ᴺ', '𝖭', '𝑁', '𝙽', '𝑵', '𝗡', '𝙽', 'Ｎ'],
    'o': ['ᴼ', '𝕆', '𝖮', '𝑂', '𝙾', '𝑶', '𝑂', '𝗢', '𝙾', 'Ｏ'],
    'p': ['ᴾ', 'ℙ', '𝖯', '𝘗', '𝑃', '𝙿', '𝑷', '𝗣', '𝙿', 'Ｐ'],
    'q': ['ᵠ', 'ℚ', '𝑄', '𝗤', 'Ｑ'],
    'r': ['ᴿ', 'ℝ', '𝖱', '𝘙', '𝑅', '𝑹', '𝑅', '𝗥', 'Ｒ'],
    's': ['ˢ', '𝕊', '𝖲', '𝘚', '𝑆', '𝑺', '𝑆', '𝗦', 'Ｓ'],
    't': ['ᵀ', '𝕋', '𝖳', '𝘛', '𝑇', '𝑻', '𝑇', '𝗧', 'Ｔ'],
    'u': ['ᵁ', '𝕌', '𝖴', '𝘜', '𝑈', '𝑼', '𝗨', 'Ｕ'],
    'v': ['ⱽ', '𝕍', '𝖵', '𝘝', '𝑉', '𝑽', '𝗩', 'Ｖ'],
    'w': ['ʷ', '𝕎', '𝖶', '𝘞', '𝑊', '𝑾', '𝗪', 'Ｗ'],
    'x': ['ˣ', '𝕏', '𝖷', '𝘟', '𝑋', '𝑿', '𝗫', 'Ｘ'],
    'y': ['ʸ', '𝕐', '𝖸', '𝑌', '𝑌', '𝗬', 'Ｙ'],
    'z': ['ᶻ', 'ℤ', '𝖹', '𝑍', '𝗭', 'Ｚ'],
    'и': ['ᴵ', '𝓘', '𝖨', '𝘌'],
    'й': ['ᴶ', '𝒥', '𝖪'],
    'к': ['𝗞', '𝑲'],
    'л': ['𝑳'],
    'м': ['𝗠'],
    'н': ['𝐻'],
    'о': ['𝑶', '𝗢'],
    'п': ['𝑷'],
    'р': ['𝗣'],
    'с': ['𝐶'],
    'т': ['𝑻'],
    'у': ['𝒲'],
    'ф': ['𝑲'],
    'х': ['𝗫'],
    'ц': ['𝑪'],
    'ч': ['𝑯'],
    'ш': ['𝑬'],
    'щ': ['𝑷'],
    'ы': ['𝑪'],
    'э': ['𝑷'],
    'ю': ['𝑬'],
    'я': ['𝑲'],
    ' ': [' ', ' ', ' ', ' '],  # Пробел остаётся как есть
}

def encrypt_text(text):
    """Зашифровывает текст, заменяя каждый символ на случайный Unicode-символ из списка."""
    encrypted_text = ""
    
    for char in text:
        if char in UNICODE_MAP:
            encrypted_text += choice(UNICODE_MAP[char])
        else:
            encrypted_text += char  # Если символ не найден в словаре, оставляем его как есть
    
    return encrypted_text
